Revit 2024 API
ParameterTypeId.SlantedColumnGeometryTreatmentBase Property
 "Base Geometry Alignment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SlantedColumnGeometryTreatmentBase { get; }
Visual Basic
Public Shared ReadOnly Property SlantedColumnGeometryTreatmentBase As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SlantedColumnGeometryTreatmentBase {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace